# ReverseIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalApplicationArray..::..ReverseIterator Method
ExternalApplicationArray Class See Also
---
Retrieve a backward moving iterator to the array.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual ExternalApplicationArrayIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As ExternalApplicationArrayIterator
```

Visual C++
---
```text
public:
virtual ExternalApplicationArrayIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the array.
# See Also
ExternalApplicationArray Class
Autodesk.Revit.UI Namespace